Revit 2027 API
UIDocument.ActiveGraphicalView Property
 The currently active graphical view of the currently active document.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public View ActiveGraphicalView { get; }
Public ReadOnly Property ActiveGraphicalView As View
	Get
public:
property View^ ActiveGraphicalView {
	View^ get ();
}
member ActiveGraphicalView : View with get
Property Value
View
Remarks
 This property is applicable to the currently active document only. Returns null if this document doesn't represent the active document.
See Also
Reference
UIDocument Class
Autodesk.Revit.UI Namespace